root-2.3.0/run/tutorials/combustion/fireFoam/les/flameSpreadWaterSuppressionPanel/0/muSgs
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    location        "0";
    class           volScalarField;
    object          muSgs;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    ground
    {
        type            mutUSpaldingWallFunction;
        value           uniform 0;
    }

    side
    {
        type            calculated;
        value           uniform 0;
    }

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    region0_to_pyrolysisRegion_coupledWall
    {
        type            mutUSpaldingWallFunction;
        value           uniform 0;
    }

}


// ************************************************************************* //
